import { put } from "@vercel/blob";
import { NextResponse } from "next/server";
import { map, merge, pick } from "lodash";
import { createPost } from "@/actions/post";
import { env } from "@/lib/utils";

export async function POST(request: Request): Promise<NextResponse> {
  const formData = await request.formData();
  const files = formData.getAll("files");

  // console.log(files.length);

  const blobsPrommise = files
    .map((file: any) => {
      if (typeof file !== "string") {
        return put(`demo/${file.name}`, file, {
          access: "public",
          multipart: true,
        });
      }
    })
    .filter(Boolean);

  const fetchUrl = new URL(
    "/bulk-upload",
    env("NEXT_PUBLIC_OCR_URL", "http://127.0.0.1:8000")
  );
  const extractedPromise = fetch(fetchUrl, {
    method: "POST",
    body: formData,
  })
    .then((res) => res.json())
    .then((data) => data.results as { text: string; file: string }[]);

  const [blobs, results] = await Promise.all([
    Promise.all(blobsPrommise),
    extractedPromise,
  ]);

  // const blobs = [
  //   {
  //     url: "https://esztt3owbm3llyro.public.blob.vercel-storage.com/demo/0002-N7Oy6Ta0hYjwk54T8cvr1oqHbXbxVg-qbi6EoSQ4ho96jplw8I4L7JCCqrQ2Z.jpg",
  //     downloadUrl:
  //       "https://esztt3owbm3llyro.public.blob.vercel-storage.com/demo/0002-N7Oy6Ta0hYjwk54T8cvr1oqHbXbxVg-qbi6EoSQ4ho96jplw8I4L7JCCqrQ2Z.jpg?download=1",
  //     pathname: "demo/0002-N7Oy6Ta0hYjwk54T8cvr1oqHbXbxVg.jpg",
  //     contentType: "image/jpeg",
  //     contentDisposition:
  //       'inline; filename="0002-N7Oy6Ta0hYjwk54T8cvr1oqHbXbxVg.jpg"',
  //   },
  //   {
  //     url: "https://esztt3owbm3llyro.public.blob.vercel-storage.com/demo/0001-xnVlFmzSRrcSxErrVVghVjz8cGAjrp-ya1ch56dvqMWvLzd2WiB1G589wAYGt.jpg",
  //     downloadUrl:
  //       "https://esztt3owbm3llyro.public.blob.vercel-storage.com/demo/0001-xnVlFmzSRrcSxErrVVghVjz8cGAjrp-ya1ch56dvqMWvLzd2WiB1G589wAYGt.jpg?download=1",
  //     pathname: "demo/0001-xnVlFmzSRrcSxErrVVghVjz8cGAjrp.jpg",
  //     contentType: "image/jpeg",
  //     contentDisposition:
  //       'inline; filename="0001-xnVlFmzSRrcSxErrVVghVjz8cGAjrp.jpg"',
  //   },
  //   {
  //     url: "https://esztt3owbm3llyro.public.blob.vercel-storage.com/demo/0001-LbAZDm3sDWdO2hV8CmodeNNcVVgSsv-ku89gytRss8LFNP0xl6Qu2kbj69RXo.jpg",
  //     downloadUrl:
  //       "https://esztt3owbm3llyro.public.blob.vercel-storage.com/demo/0001-LbAZDm3sDWdO2hV8CmodeNNcVVgSsv-ku89gytRss8LFNP0xl6Qu2kbj69RXo.jpg?download=1",
  //     pathname: "demo/0001-LbAZDm3sDWdO2hV8CmodeNNcVVgSsv.jpg",
  //     contentType: "image/jpeg",
  //     contentDisposition:
  //       'inline; filename="0001-LbAZDm3sDWdO2hV8CmodeNNcVVgSsv.jpg"',
  //   },
  //   {
  //     url: "https://esztt3owbm3llyro.public.blob.vercel-storage.com/demo/0001-BexCnvldhiQ8Q0BqcvCO90mMkajOD9-k9yQcSddr4VD8ulsJAVg5wNpMyWgVh.jpg",
  //     downloadUrl:
  //       "https://esztt3owbm3llyro.public.blob.vercel-storage.com/demo/0001-BexCnvldhiQ8Q0BqcvCO90mMkajOD9-k9yQcSddr4VD8ulsJAVg5wNpMyWgVh.jpg?download=1",
  //     pathname: "demo/0001-BexCnvldhiQ8Q0BqcvCO90mMkajOD9.jpg",
  //     contentType: "image/jpeg",
  //     contentDisposition:
  //       'inline; filename="0001-BexCnvldhiQ8Q0BqcvCO90mMkajOD9.jpg"',
  //   },
  // ];

  // const results = await extractedPromise;

  // const results = [
  //   {
  //     text: "১১৪. জীববিজ্ঞান প্রথম পত্র\nনিম্নোক্ত সারণি : ১ ও ২-এ কোষে বিদ্যমান উ\n\ni\nজল নসিমন [০৩৭]\n\nপি সিল টা sce | ig\nসালফার —[—oss [a\n\nজা নখ র\nএকক হলো এটম বা পরমাণু | এটমের কেন্দ্রস্থলে নিউক্রিয়াসে) প্রোটন +) এবং নিউট্রন (০) এ\nনিউক্লিয়াসের বাইরে নেগেটিভ চার্জবিশিষ্ট ইলেক্ট্রন থাকে | অধিকাংশ এটমে সমসংখ্যক প্রোটন (+) ও ইলেকট্রন (-)\n_থাকে।\n\nকম্পাউন্ড (Compound) বাঁ যৌগ : দুই বা তার অধিক এলিমেন্ট সুনির্দিষ্ট অনুপাতে সংযুক্ত হয়ে একটি কম্পাউন্ড\nবা যৌগ গঠন করে, যেমন 2H, + O, =2H,0 অর্থাৎ, এবং ০, সুনির্দিষ্ট অনুপাতে যুক্ত হয়ে পানি নামক যৌগ গঠন\nকরেছে৷ একটি কম্পাউন্ডের এটমগুলো রাসায়নিক বন্ডের (chemical bond) মাধ্যমে একত্রে সংযুক্ত থাকে |\n\nরাসায়নিক বন্ড (Chemical bond) : রাসায়নিক বন্ড সাধারণত তিন প্রকার; যথা Tonic (আয়োনিক), Covalent\n(কোভ্যালেন্ট) ও Hydrogen bond (হাইড্রোজেন বন্ড) |\n\nআয়োনিক বন্ড (Ionic bond) : আয়োনিক বন্ড প্রতিষ্ঠিত হয় দুটি এটমের মধ্যে | একটি এটম থেকে এক বা\nএকাধিক BAT অন্য এটমে স্থানান্তর হয় 1 প্রথম এটম ইলেক্ট্রন হারিয়ে পজিটিভ চার্জবিশিষ্ট হয় এবং অপরটি ইলেন্ট্রন\nগ্রহণ করে নেগেটিভ চার্জ বিশিষ্ট হয় | এটমের চার্জ বিশিষ্ট (+ অথবা - ) অবস্থাকে আয়ন (ion) বলে | পজিটিভ (+)\nএবং নেগেটিভ () চার্জ বিশিষ্ট আয়ন প্রবলভাবে পরস্পরকে আকর্ষণ করে যার ফলে আয়নিক বন্ড তৈরি হয় |\n\nকোভ্যালেন্ট বন্ড (Covalent bond) : দুটি এটমের মধ্যে ইলেকট্রন শেয়ার বা ভাগাভাগি হলে কোভ্যালেন্ট বন্ড\nসৃষ্টি হয় । দুটি এটমের মধ্যে ইলেক্ট্রন সমানভাবে ভাগাভাগি হলে যে বন্ড তৈরি হয় তা হলো Nonpolar covalent বন্ড |\nইলেকট্রন দুটি এটমের মধ্যে অসমভাবে ভাগাভাগি হলে যে বন্ড তৈরি হয় তা হলো Polar covalent বন্ড |\n\n0 ০\nসি নি\na Pong? ha? oe\n\nSy\n/ ৯৯\nH H\n\n5\nহাইড্রোজেন inane Ne\n\n720 : একটি পোলার অণু পানির অণুতে হাইড্রোজেন বন্ড\nচিত্র : ৩.১ : পোলার অণু ও হাইড্রোজেন বন্ড\nহাইড্রোজেন বন্ড (Hydrogen bond) : এক অণুর আংশিক পজিটিভ চার্জবিশিষ্ট হাইড্রোজেন পরমাণু (atom)\nএবং অপর GIA (molecule) আংশিক নেগেটিভ চার্জবিশিষ্ট পরমাণুর মধ্যে আকর্ষণজনিত শক্তির (attraction force)\nকারণে যে বন্ড তৈরি হয় তা হলো হাইড্রোজেন বন্ড |\nপেপটাইড বন্ড (Peptide bond) : দুটি আামিনো এসিডের মধ্যকার সৃষ্ট বন্ড | এটি কোভ্যালেন্ট বন্ড |\nগ্রাইকোসাইডিক বন্ড (07150051010 bond) : মনোস্যাকারাইডসমূহের মধ্যকার বন্ড হলো গ্রাইকোসাইডিক বন্ড |\n\n",
  //     file: "0002-N7Oy6Ta0hYjwk54T8cvr1oqHbXbxVg.jpg",
  //   },
  //   {
  //     text: "| [1 কোষ > Cell Division\n\nজীবের বৃদ্ধি ও পরিস্ফুটন নির্ভর করে কোষের বিভাজন এবং আয়তনে বৃদ্ধি হওয়ার at শব্দাবলি (Key words)\nউপর | বহুকোষী জীবের ক্ষেত্রে এককোষী জাইগোট বিভাজিত হয়ে বিভিন্ন টিস্যুতে [7 রর ু\nপরিণত হয়ে পূর্ণাঙ্গ জীবদেহ গঠন করে। জীবের অযৌন ও যৌন জননও কোষ |.\nবিভাজনের উপর নির্ভরশীল। এ অধ্যায়ে মাইটোসিস ও মিয়োসিস কোষ বিভাজনের\nচিরিক রন icin\n\nঅঙ্কন স্থায়ী স্লাইড) পর্যবেক্ষণ\n\nভিন রর রা হয় গরটিসা কোষ দিয়ে | SEC 8 জোয়ার নর লোন\nথেকেই | BUTS ভিরশীও (Rodolf Virchow, 1858) যথার্থই বলেছেন যে “গাছ থেকে যেমন গাছের সৃষ্টি হয়, প্রাণী\nথেকে সৃষ্টি হয় প্রাণী, ঠিক তেমনি কোষ থেকেই কেবল কোষের সৃষ্টি হতে পারে”। ওয়াল্টার ফ্রেমিং (Walter\nFlemming, 1882) সর্বপ্রথম Triturus maculosa (সামুদ্রিক স্যালামান্ডার)-এর কোষে কোষ বিভাজন পর্যবেক্ষণ\nকরেন। জীবদেহে কোষ বিভাজন একটি মৌলিক ও অত্যাবশ্যকীয় প্রক্রিয়া, এর মাধ্যমেই জীবের দৈহিক বৃদ্ধি ও বংশবৃদ্ধি\nঘটে। যে প্রক্রিয়ায় জীবকোষে বিভক্তির মাধ্যমে একটি থেকে দুটি বা চারটি কোষের সৃষ্টি হয় তাকে কোষ বিভাজন বলা\nহয়। কোষ বিভাজনের ফলে সৃষ্ট নতুন কোষকে বলে অপত্য কোষ (daughter cell) এবং যে কোষটি থেকে অপত্য\nকোষ সৃষ্টি হয় সে কোষটি হলো মাতৃকোষ (mother cell) | উদ্ভিদ ও প্রাণিদেহে তিনধরনের কোষ বিভাজন দেখা যায়,\nযেমন-১, আ্যামাইটোসিস, ২. মাইটোসিস ও হিকোগিস। নিচে এদের বরদনা দেয়া হলো।\n\nEe RR RTT একটাতৃকোনের দিন সিও সাইটটির কোনে arate ade SRE\nসরাসরি বিভক্ত হয়ে দুটি অপত্য (শিশু) কোষের সৃষ্টি করে, তাকে আ্যামাইটোসিস বা প্রত্যক্ষ কোষ বিভাজন বলে | কোষ\nবিভাজনের শুরুতে নিউক্লিয়াসটি ধীরে ধীরে লম্বা হতে থাকে এবং পরে দু'প্রান্ত মোটা ও মাঝের অংশটি সরু হয়ে\nডাম্বেলের আকৃতি ধারণ করে। মাঝের সরু\n\nঅংশটি ক্রমশ আরও সরু হয়ে দুটি খন্ডে বে\n(১১\nকরে। নিউক্লিয়াসের বিভাজনের সাথে সাথে mes CE\n\nকোষের AA মধ্যভাগে ভিতরের\nটি (৩১)\nবিভক্ত করে ফেলে এবং দুটি অপত্য কোষের চিত্র: OOS\n",
  //     file: "0001-xnVlFmzSRrcSxErrVVghVjz8cGAjrp.jpg",
  //   },
  //   {
  //     text: "প্রতিটি জীব তার প্রতিরপ সৃষ্টি করতে সক্ষম। এটি জীবের প্রধান শব্দাবলি\n\nঅন্যতম সহজাত বৈশিষ্ট্য | এককোষী কিংবা বহুকোষী সকল (Key words)\n\nজীবের জীবন সূচনা হয় একটিমাত্র কোষ হতে । বহুকোষী কোষ বিভাজন _2মাকুতন্ত.\n| জীবের ক্ষেত্রে এককোষী জাইগোট অবস্থা হতে ক্রমাগত 0 মাইটোসিস । সিন্যাপসিস\n1 বির নিচ অন নুন পাটি কিনে কব চ্েমিওসির 0 বাইভ্যালেন্ট\nহতে নতুন কোষ সৃষ্ট হওয়ার প্রক্রিয়াকে কোষ বিভাজন বলে। a\n\n1 জীবের দৈহিক বৃদ্ধি, বংশবৃদ্ধি ও বিভিন্ন অঙ্গের ক্রমবিকাশের ডি\nজন্য কোষ বিভাজন একটি মৌলিক ও অত্যাবশ্যকীয় ঘটনা।  ক্রোমাটিভ 9 কোষচক্রু\nএ অধ্যায়ে জীবের কোষ বিভাজন সম্পর্কে আলোচনা করা  সাইটোকাইনেসিস\nহয়েছে। OSPR ওভার\nপিরিয়ড সংখ্যা ৮ : এ অধ্যায় পাঠ শেষে শিক্ষার্থীরা যা পারবে (শিখনফল)- পু\nici ee ee ee Ase a Cee J\ncc Ok 78 কোষ বিভাজন\n২। মিওসিসের পর্যায়সমূহ বর্ণনা করতে পারবে । ০ মাইটোসিস\n৩। মিওসিসের পর্যায়সমূহের চিত্র অঙ্কন করে চিহিন্ত করতে পারবে | ০ মিওসিস\n৪। জীবদেহে মিওসিসের গুরুত্ব বিশ্লেষণ করতে পারবে | ০ গুরুত্ব\n¢ | জীবনের ধারাবাহিকতা রক্ষায় মিওসিস কোষ বিভাজনের অবদান উপলব্ধি | © ব্যবহারিক\nকরতে পারবে। ০ মাইটোসিস কোষ\n৬। ব্যবহারিক: মাইটোসিস বিভাজন পর্যবেক্ষণ করে চিত্র অংকন করতে বিভাজনের বিভিন্ন পর্যায় (স্থায়ী\n\nযে পদ্ধতিতে কোনো মাতৃকোষ অনুরূপ গুণ ও বৈশিষ্ট্য সম্পন্ন দুই বা ততোধিক অপত্যকোষ সৃষ্টি করে তাকে কোষ\nবিভাজন বলে। বিজ্ঞানী ওয়াল্টার ফ্লেমিং (Walter Flemming) 1882 সালে সামুদ্রিক স্যালামান্ডার, Triturus\n71201954-এর কোষে প্রথম কোষ বিভাজন প্রত্যক্ষ করেন। এককোবী জীব কোষ বিভাজনের মাধ্যমে বংশবৃদ্ধি করে,\nকিন্তু বহুকোষী জীবে কোষ বিভাজনের মাধ্যমে দৈহিক বৃদ্ধি ও ক্ষয়পুরণ ঘটে । বিভিন্ন কোষের বিভাজন ও বৃদ্ধি\nবিভিন্নভাবে নিয়ন্ত্রিত হলেও বহুকোষী জীবের ক্ষেত্রে এর মৌলিক প্রক্রিয়া অনেকটা একইরকম | মানুষের জীবনকালে\nদেহের কোষগুলো প্রায় 10 কোয়াদ্রিলিয়ন (10১) বার বিভাজিত হয়। কোষ বিভাজনের ফলে সৃষ্ট নতুন কোষকে বলে\nঅপত্য কোষ (daughter cell) এবং যে কোষটি বিভাজিত হয়ে অপত্য কোষ সৃষ্টি করে তাকে বলে মাতৃকোষ\n(mother cell) | at লোহিত রক্ত কণিকা, স্লায়ুকোষ ও মসৃণ পেশি কোষে (কঙ্কাল ও LAM) এবং উদ্ভিদের\nস্থায়ী কোষসমূহে কোনো কোষ বিভাজন ঘটে AT |\n\nকোষ বিভাজনের মূল বিষয় হলো অপত্য কোষে মাতৃকেষের জিনোমকে সুস্থিত রাখা | একারণে কোষ বিভাজনের\nপূর্বে ক্রোমোসোমে সংরক্ষিত জীবের জিনোমিক তথ্যগুলোর প্রতিলিপন ঘটে এবং কোষ বিভাজনের সময় সমভাবে\nঅপত্য কোষসমূহে AGS হয়। মানুষের একটি সাধারণ দেহকোষে মাত্র 4-60 বার প্রতিলিপন ও বিভাজন ঘটে।\nএরপর এরা এদের বিভাজন ক্ষমতা হারিয়ে ফেলে এবং নিজে নিজেই ধ্বংসপ্রাপ্ত হয়। কোষের এ বৈশিষ্ট্যকে\nআযাপোটোসিস (apoptosis) বলে এবং এর ফলশ্রুতিতে আমাদের দেহ পুরানো কোষ বা অবাঞ্চিত কোষ বা\nজেনেটিকেলি ক্ষয়প্রাপ্ত কোষ হতে মুক্তিলাভ Be |\nজীববিজ্ঞান প্রথম ৬ খে)\n",
  //     file: "0001-LbAZDm3sDWdO2hV8CmodeNNcVVgSsv.jpg",
  //   },
  //   {
  //     text: "Cell & its structure\n\nএ পৃথিবীতে অসংখ্য প্রজাতির জীব বাস Hea | এদের মধ্যে কারোর দেহ একটি\nকোষ আবার অন্যদের দেহ একাধিক কোষ নিয়ে গঠিত। বৃদ্ধি, জনন, সংবেদনে সাড়া\nদেওয়া এবং রেচন, শ্বসন প্রভৃতি নানা জৈবিক ক্রিয়াকলাপ সম্পাদন প্রতিটি সজীব\nকোষের সাধারণ ধর্ম। এজন্য কোষ হলো জীবদেহের গঠনমূলক ও জৈবিক\nক্রিয়াকলাপের একক। এককোধী জীবেরা একটি কোষের মাধ্যমে সকল জৈবিক\nক্রিয়াকলাপ সম্পাদন করলেও বহুকোষী জীবদের ক্ষেত্রে বিভিন্ন কোষের মধ্যে কাজের\nবন্টন দেখা যায়। প্রতিটি কোষ ধ্োটোপ্রাজম নামক জেলির মতো পিচ্ছিল সজীব\nপদার্থ দিয়ে তৈরি। এই প্রোটোপ্রাজমকে ঘিরে থাকে একটি বৈষম্যভেদ্য পরা বা\nআবরণ | এ অধ্যায়ে কোষীয় অঙ্গাণু এবং জীবদেহে এদের ভূমিকা সম্পর্কে আলোচনা\nকরা হয়েছে।\n\nকোষপ্রাচীর ও কোষবিন্লির অবস্থান, রাসায়নিক গঠন ও পাঠ\nকাজ\nসাইটোপ্রাজমের রাসায়নিক প্রকৃতি এবং বিপাকীয় ভূমিকা\nরাইবোজোম, গলজি বস্তু, রাইবোজোম, সেক্্িওলের\nঅবস্থান, গঠন ও কাজ\n\nগঠন ও কাজের ভিত্তিতে মসৃণ ও অসমৃণ এভোপ্রাজমিক\nরেটিকুলাম এর মধ্যে পার্থক্য\n\nমাইটোকন্দ্রিয়নের বহির্গঠন ও অন্তর্গঠনের সাথে এর\nকাজের আত্তঃসম্পর্ক\n\nক্লোরোপ্রাস্টের বহির্গঠন ও অন্তর্গঠনের সাথে এর কাজের\nআন্তঃসম্পর্ক\n\nনিউক্লিয়াসের গঠন ও কাজ\n\nনিউক্লিওপ্লাজম ও সাইটোপ্রাজমের রাসায়নিক গঠনের\nতুলনা ক্রোমোজোমের গঠন\n\nকোষের বিভিন্ন অঙ্গাণুর চিহ্রিত চিত্র অঙ্কন ক্রোমোজোমের প্রকারভেদ ও কোষ বিভাজনে এর ভূমিকা\nজীবের বিভিন্ন কার্যক্রমে কোষের অবদান ংশগতি বস্তু\n\nক্রোমোজোমের গঠন ও এর রাসায়নিক উপাদান ডিঅক্সিরাইবোনিউক্লিক এসিড (DNA)\nকোষ বিভাজনে ক্রোমোজোমের ভূমিকা রাইবোনিউক্লিক এসিড (RNA)\n\nডিএনএ ও আরএনএ-এর গঠন ও কাজ DNA অনুলিপন\n\nআরএনএ-এর প্রকারভেদ DNA অনুলিপন কৌশল\n\nডিএনএ রেপ্রিকেশনের প্রক্রিয়া জীবীয় তথ্য প্রবাহ\n\nট্রাসক্রিপশনের কৌশল ট্রান্সক্রিপশন\n\nটরা্সলেশনের ব্যাখ্যা ্রা্সলেশন\n\nজিন\nজিন ও জেনেটিক কোড\n\nof\n\n১০\n\nbe\n\n/\n~~\n\nae\n\n",
  //     file: "0001-BexCnvldhiQ8Q0BqcvCO90mMkajOD9.jpg",
  //   },
  // ];

  // @ts-ignore
  const data = merge(blobs, results).map((obj) => ({
    //   @ts-ignore
    text: obj.text,
    imageUrl: obj!.url,
    chapterId: formData.get("chapterId")!.toString(),
  }));

  await createPost(data);

  return NextResponse.json(data);
}
